[
    { "text": "What prerequisites are needed for a client to access assigned forms in the portal?", "intent": "information" },
    { "text": "What does a client need in place to receive portal-delivered forms?", "intent": "information" },
    { "text": "Which conditions must be met before a client can view forms in the portal?", "intent": "information" },
    { "text": "What are the minimum requirements for a client to complete assigned forms via the portal?", "intent": "information" },
    { "text": "My client can’t see any assigned forms in the portal—what requirements should I check first?", "intent": "error" },
    { "text": "The portal isn’t showing forms for a client. What prerequisites could be failing?", "intent": "error" },
    { "text": "Clients are reporting that forms don’t appear in the portal. What requirements do I need to verify?", "intent": "error" },
    { "text": "A client didn’t receive their forms—what conditions must be met so I can troubleshoot this?", "intent": "error" },
    { "text": "Can you explain the process a client must follow to be able to receive forms in the portal?", "intent": "flow" },
    { "text": "What is the required setup workflow for a client so they can access forms through the portal?", "intent": "flow" },
    { "text": "Before sending forms through the portal, what conditions or steps must a client complete?", "intent": "flow" },
    { "text": "What is the workflow a client must meet or follow to ensure they can access forms in the portal?", "intent": "flow" },

    { "text": "Is an active portal account required for a client to receive forms?", "intent": "information" },
    { "text": "Do clients need their portal account to be active in order to access assigned forms?", "intent": "information" },
    { "text": "Is having an active portal account a prerequisite for clients to receive forms through the portal?", "intent": "information" },
    { "text": "Does a client’s portal account need to be active so they can view assigned forms?", "intent": "information" },
    { "text": "My client isn’t receiving forms—could the issue be that their portal account isn’t active?", "intent": "error" },
    { "text": "Forms aren't showing up for my client. Is it possible their portal account is inactive?", "intent": "error" },
    { "text": "Why might a client not receive forms in the portal? Could an inactive account be the reason?", "intent": "error" },
    { "text": "If a client isn’t getting any forms, does that mean their portal account might not be active?", "intent": "error" },  
    { "text": "At what point in the setup process does the client need to have an active portal account to receive forms?", "intent": "flow" },
    { "text": "As part of the workflow, when should the client’s portal account be activated to allow form delivery?", "intent": "flow" },
    { "text": "Which step of the portal setup requires the client’s account to be active so they can get forms?", "intent": "flow" },
    { "text": "In the process of preparing a client for portal use, when does account activation become necessary for receiving forms?", "intent": "flow" },

    { "text": "Is a registered email required for a client to use Portal Form Assignment?", "intent": "information" },
    { "text": "Does the client need to have an email on file to access Portal Form Assignment?", "intent": "information" },
    { "text": "Is having a registered email a prerequisite for using Portal Form Assignment?", "intent": "information" },
    { "text": "Do clients need a valid email stored in their profile to use Portal Form Assignment?", "intent": "information" },
    { "text": "My client isn’t receiving form notifications—could it be because they don’t have a registered email?", "intent": "error" },
    { "text": "A client can’t activate their portal account. Should I check if their email is missing?", "intent": "error" },
    { "text": "Forms aren’t being delivered to the client. Could an unregistered email be causing this issue?", "intent": "error" },
    { "text": "The client reports they can’t access Portal Form Assignment. Is their email not registered?", "intent": "error" },  
    { "text": "At what step in the setup flow does the client need to have a registered email to use Portal Form Assignment?", "intent": "flow" },
    { "text": "During the client onboarding process, when should the email be registered for Portal Form Assignment to work?", "intent": "flow" },
    { "text": "Which part of the workflow requires the client's email to be added so they can use Portal Form Assignment?", "intent": "flow" },
    { "text": "In the process of preparing a client for portal use, when is the email required for form delivery?", "intent": "flow" },

    { "text": "Which permissions are required for staff to assign portal forms?", "intent": "information" },
    { "text": "What access levels does staff need in order to assign forms through the portal?", "intent": "information" },
    { "text": "Are there specific permissions that must be enabled for staff to assign portal forms?", "intent": "information" },
    { "text": "What role permissions are necessary for a staff member to assign forms to clients?", "intent": "information" },
    { "text": "A staff member can't assign portal forms—could missing permissions be the cause?", "intent": "error" },
    { "text": "Why is the 'Assign Portal Forms' option not appearing? Should I check staff permissions?", "intent": "error" },
    { "text": "Forms aren't being assigned correctly—could staff be lacking required permissions?", "intent": "error" },
    { "text": "The system prevents staff from assigning portal forms. Is a permission missing?", "intent": "error" },
    { "text": "What permissions must be enabled at each step of the workflow for staff to assign portal forms?", "intent": "flow" },
    { "text": "During the assignment process, which permissions are required for staff to proceed?", "intent": "flow" },
    { "text": "As part of the workflow, what permissions must staff have before they can assign forms?", "intent": "flow" },
    { "text": "Which staff permissions are needed at the start of the portal form assignment process?", "intent": "flow" },

    { "text": "What conditions must a form meet to be eligible for portal assignment?", "intent": "information" },
    { "text": "Which settings need to be enabled on a form before it can be assigned to the portal?", "intent": "information" },
    { "text": "What configuration requirements are necessary for a form to appear in the portal assignment list?", "intent": "information" },
    { "text": "What criteria determine whether a form can be assigned to the portal?", "intent": "information" },
    { "text": "The form is not appearing in the portal assignment list—could it be missing required settings?", "intent": "error" },
    { "text": "Why can't staff assign this form to the portal? Is it not configured correctly?", "intent": "error" },
    { "text": "A form is failing to be assigned—should I check if it's enabled for the portal or published?", "intent": "error" },
    { "text": "The system won't allow the form to be assigned to the portal. Could the configuration be incomplete?", "intent": "error" },
    { "text": "At what step in the workflow must the form meet all requirements to be assigned to the portal?", "intent": "flow" },
    { "text": "During the form setup process, when should the form be enabled, published, and configured for client submission?", "intent": "flow" },
    { "text": "What configuration steps must be completed in the workflow before a form can be assigned to the portal?", "intent": "flow" },
    { "text": "Which part of the setup flow requires verifying that the form is enabled for portal and published?", "intent": "flow" },

    { "text": "What is the process for assigning a form to a client in CareLogic?", "intent": "information" },
    { "text": "How does staff assign a form to a client within CareLogic?", "intent": "information" },
    { "text": "What steps are involved in assigning forms to clients in CareLogic?", "intent": "information" },
    { "text": "How does the system handle the assignment of forms to clients in CareLogic?", "intent": "information" },
    { "text": "Why is the system not allowing staff to assign a form to the client in CareLogic?", "intent": "error" },
    { "text": "A form isn't being assigned to the client—could the workflow or configuration be incorrect?", "intent": "error" },
    { "text": "Why can’t the form be linked or sent to the client in CareLogic?", "intent": "error" },
    { "text": "The form assignment process failed—what might be preventing the assignment from completing?", "intent": "error" },
    { "text": "What is the workflow for assigning a form to a client in CareLogic?", "intent": "flow" },
    { "text": "Which steps must be followed to assign a form to the client from CareLogic?", "intent": "flow" },
    { "text": "What is the recommended flow for assigning forms to clients in CareLogic?", "intent": "flow" },
    { "text": "At what point in the workflow is the form selected and assigned to the client?", "intent": "flow" },

    { "text": "Is it possible to assign the same form to more than one client?", "intent": "information" },
    { "text": "Can a single form be reused and assigned to multiple clients in CareLogic?", "intent": "information" },
    { "text": "Does the system allow assigning the same form to several different clients?", "intent": "information" },
    { "text": "Can staff assign one form template to multiple clients without restrictions?", "intent": "information" },
    { "text": "Why can’t the form be assigned to multiple clients—is the system blocking repeated assignments?", "intent": "error" },
    { "text": "A staff member tried assigning the same form to several clients, but it only worked for one. What could be causing this?", "intent": "error" },
    { "text": "The form isn’t appearing for some clients—does the system prevent assigning it more than once?", "intent": "error" },
    { "text": "Why is the form assignment failing after the first client? Could repeated assignments be restricted?", "intent": "error" },
    { "text": "What steps should staff follow to assign the same form to multiple clients?", "intent": "flow" },
    { "text": "How does the assignment workflow handle assigning the same form to several clients?", "intent": "flow" },
    { "text": "What is the correct process for repeatedly assigning the same form to different clients?", "intent": "flow" },
    { "text": "In the assignment flow, how do staff send the same form to multiple clients?", "intent": "flow" },

    { "text": "Is a submitted form editable by the client after they complete it?", "intent": "information" },
    { "text": "Can clients make changes to a form once it has been submitted through the portal?", "intent": "information" },
    { "text": "Does the system allow clients to update information after submitting a form?", "intent": "information" },
    { "text": "Is it possible for a client to reopen and edit a previously submitted form?", "intent": "information" },
    { "text": "Why is the client unable to edit the form they already submitted?", "intent": "error" },
    { "text": "A client needs to correct information on a submitted form—why doesn’t the system let them edit it?", "intent": "error" },
    { "text": "The client is reporting that the form becomes locked after submission—could something be preventing edits?", "intent": "error" },
    { "text": "Why can’t the submitted form be modified by the client even though they need to update it?", "intent": "error" },
    { "text": "What is the process for updating information if a client has already submitted their form?", "intent": "flow" },
    { "text": "What steps should staff follow when a client needs to correct a submitted form?", "intent": "flow" },
    { "text": "How should updates be handled when a client needs to modify information after submission?", "intent": "flow" },
    { "text": "What workflow is recommended when a client requests changes to a form that has already been submitted?", "intent": "flow" },

    { "text": "How are clients notified when a form is assigned to them?", "intent": "information" },
    { "text": "Does the system send email or SMS alerts when a form is assigned to a client?", "intent": "information" },
    { "text": "What types of notifications does the client receive after a form is assigned?", "intent": "information" },
    { "text": "Are clients automatically notified when staff assign them a portal form?", "intent": "information" },
    { "text": "The client isn’t receiving notifications when forms are assigned—what could be causing this?", "intent": "error" },
    { "text": "Why didn’t the client get an email or SMS after the form was assigned?", "intent": "error" },
    { "text": "Notifications are not being delivered to the client—should I check their email or phone number?", "intent": "error" },
    { "text": "The system didn’t send a notification when the form was assigned; what should I troubleshoot?", "intent": "error" },
    { "text": "What steps must be completed to ensure the client receives a notification after a form is assigned?", "intent": "flow" },
    { "text": "In the notification workflow, when is the alert sent to the client after assigning a form?", "intent": "flow" },
    { "text": "What is the process through which the client receives email or SMS notifications for assigned forms?", "intent": "flow" },
    { "text": "How does the notification flow work when a staff member assigns a form to the client?", "intent": "flow" },

    { "text": "What does the system do once the client submits the form?", "intent": "information" },
    { "text": "What is the outcome after a client submits their portal form?", "intent": "information" },
    { "text": "How is a submitted form processed by the system?", "intent": "information" },
    { "text": "What changes occur in CareLogic when the client completes and submits a form?", "intent": "information" },
    { "text": "The client submitted the form, but nothing seems to have happened—what could be wrong?", "intent": "error" },
    { "text": "Why isn’t the submitted form appearing in the system after the client completed it?", "intent": "error" },
    { "text": "The client says they submitted the form, but we can’t find it—what should I check?", "intent": "error" },
    { "text": "If the submitted form isn't showing up, does that mean something failed in the submission process?", "intent": "error" },
    { "text": "What is the workflow that occurs after the client submits a form?", "intent": "flow" },
    { "text": "What steps does the system follow once a form is submitted by the client?", "intent": "flow" },
    { "text": "How does the submission process work after the client completes their form?", "intent": "flow" },
    { "text": "What is the sequence of actions performed by CareLogic when a client submits a form?", "intent": "flow" },

    { "text": "How quickly does a submitted form sync back into CareLogic?", "intent": "information" },
    { "text": "What is the expected sync time between the portal and CareLogic after a form is submitted?", "intent": "information" },
    { "text": "How long does the system normally take to update CareLogic with a submitted form?", "intent": "information" },
    { "text": "What is the typical delay before a submitted form appears in CareLogic?", "intent": "information" },
    { "text": "The form is taking too long to appear in CareLogic—what could be causing the delay?", "intent": "error" },
    { "text": "Why hasn’t the submitted form synced with CareLogic yet?", "intent": "error" },
    { "text": "The client submitted the form, but it still isn’t showing in CareLogic—what should I check?", "intent": "error" },
    { "text": "Is something wrong if the form hasn’t synced with CareLogic after submission?", "intent": "error" },
    { "text": "What is the sync process between the portal and CareLogic once a form is submitted?", "intent": "flow" },
    { "text": "How does the workflow handle syncing a submitted form back into CareLogic?", "intent": "flow" },
    { "text": "What steps occur in the system before the form appears in CareLogic after submission?", "intent": "flow" },
    { "text": "What is the sequence of actions the system performs before the form syncs into CareLogic?", "intent": "flow" },

    { "text": "What file format does the system use to store the submitted form?", "intent": "information" },
    { "text": "How is the completed form saved once the client submits it?", "intent": "information" },
    { "text": "In which format does CareLogic archive forms after submission?", "intent": "information" },
    { "text": "What output format is generated after the client submits the form?", "intent": "information" },
    { "text": "The submitted form doesn't open correctly—could it be saved in the wrong format?", "intent": "error" },
    { "text": "Why is the submitted form not displaying properly? What format is it being saved in?", "intent": "error" },
    { "text": "The form looks different after submission—could the system be converting it into another format?", "intent": "error" },
    { "text": "The client says the submitted form cannot be viewed—could there be an issue with the file format?", "intent": "error" },
    { "text": "What is the process the system follows to convert the submitted form into its final format?", "intent": "flow" },
    { "text": "How does the workflow handle saving the form once the client submits it?", "intent": "flow" },
    { "text": "At what step in the submission flow is the form converted into its final saved format?", "intent": "flow" },
    { "text": "What is the sequence of operations involved in generating the saved format of the submitted form?", "intent": "flow" },

    { "text": "Why isn’t the submitted form showing up in the Document Library even though the client submitted it?", "intent": "error" },
    { "text": "The form submission isn’t appearing in CareLogic—what could be causing the issue?", "intent": "error" },
    { "text": "The client completed the form, but it still hasn't synced to the Document Library—what should I troubleshoot?", "intent": "error" },
    { "text": "What might be preventing the submitted form from appearing in the Document Library?", "intent": "error" },
    { "text": "What steps should I follow when a submitted form does not appear in the Document Library?", "intent": "flow" },
    { "text": "What is the proper workflow to verify and recover a form that isn’t showing after submission?", "intent": "flow" },
    { "text": "How should staff proceed when a submitted form fails to appear in the Document Library?", "intent": "flow" },
    { "text": "What is the recommended sequence for checking why a submitted form is missing from the Document Library?", "intent": "flow" },

    { "text": "In which section of CareLogic is the completed form stored once submitted?", "intent": "information" },
    { "text": "Where can staff view the finalized form after the client submits it?", "intent": "information" },
    { "text": "What area of CareLogic stores the completed version of a submitted form?", "intent": "information" },
    { "text": "Where does CareLogic save completed forms for later review?", "intent": "information" },
    { "text": "The completed form isn’t appearing where expected—where should it normally be stored in CareLogic?", "intent": "error" },
    { "text": "Why can’t I find the client’s completed form in CareLogic—could it be stored in a different location?", "intent": "error" },
    { "text": "The form was submitted but I can’t locate it—where is it supposed to be saved in CareLogic?", "intent": "error" },
    { "text": "The system isn’t showing the submitted form—where should I check for its stored location?", "intent": "error" },
    { "text": "What is the workflow that determines where a completed form is stored in CareLogic?", "intent": "flow" },
    { "text": "After submission, what steps does the system follow before storing the completed form in CareLogic?", "intent": "flow" },
    { "text": "How does CareLogic route and store the completed form once it has been submitted?", "intent": "flow" },
    { "text": "What sequence does the system use to place the completed form in its final storage location in CareLogic?", "intent": "flow" },

    { "text": "Which staff members are able to view the forms submitted by a client?", "intent": "information" },
    { "text": "Who has access to the client’s submitted forms in CareLogic?", "intent": "information" },
    { "text": "What permission levels are required to see submitted client forms?", "intent": "information" },
    { "text": "Which roles are allowed to view forms after the client submits them?", "intent": "information" },
    { "text": "A staff member cannot see the client’s submitted form—who is supposed to have access?", "intent": "error" },
    { "text": "Why can’t I view the submitted form? Which users should normally be able to see it?", "intent": "error" },
    { "text": "The submitted form isn’t visible to the team—who should have permission to access it?", "intent": "error" },
    { "text": "A submitted form isn’t showing up for a staff user—what visibility roles should I check?", "intent": "error" },
    { "text": "Who becomes able to view the form once the client submits it as part of the workflow?", "intent": "flow" },
    { "text": "In the visibility flow, which roles gain access after the client completes and submits the form?", "intent": "flow" },
    { "text": "How does the system determine who can see the form once it moves through the submission workflow?", "intent": "flow" },
    { "text": "What is the visibility flow for determining which staff members can access submitted client forms?", "intent": "flow" },

    { "text": "Is it possible to cancel a form that has already been assigned to a client?", "intent": "information" },
    { "text": "Can staff remove or cancel a form after it has been assigned?", "intent": "information" },
    { "text": "Does CareLogic allow the cancellation of an assigned form before the client submits it?", "intent": "information" },
    { "text": "What options are available if a form needs to be canceled after being assigned?", "intent": "information" },
    { "text": "Why am I unable to cancel the assigned form—does the system prevent cancellation?", "intent": "error" },
    { "text": "A staff user tried to cancel an assigned form but the option doesn't appear—what could be wrong?", "intent": "error" },
    { "text": "The client received a form by mistake, but I can’t cancel it—what should I check?", "intent": "error" },
    { "text": "The system won’t allow me to remove an assigned form—what might be causing this issue?", "intent": "error" },
    { "text": "What steps should be followed to cancel an assigned form in CareLogic?", "intent": "flow" },
    { "text": "How does the cancellation workflow work for forms that have already been assigned?", "intent": "flow" },
    { "text": "What is the proper process for canceling a form that has been assigned to a client?", "intent": "flow" },
    { "text": "At what point in the workflow can a staff member cancel an already assigned form?", "intent": "flow" },

    { "text": "Is it possible to reopen a form after the client has already submitted it?", "intent": "information" },
    { "text": "Can staff unlock a submitted form so the client can make changes?", "intent": "information" },
    { "text": "Does CareLogic allow reopening a form once the client has completed and submitted it?", "intent": "information" },
    { "text": "Can a submitted form be made editable again for the client?", "intent": "information" },
    { "text": "The client needs to fix information on a submitted form—why can’t it be reopened?", "intent": "error" },
    { "text": "Why is the system not letting me reopen a form that the client already submitted?", "intent": "error" },
    { "text": "A staff member tried to reopen a submitted form, but the option is unavailable—what could be wrong?", "intent": "error" },
    { "text": "The client says they submitted the form with errors, but it can’t be reopened—what should I check?", "intent": "error" },
    { "text": "What is the proper workflow when a client needs to update a form that has already been submitted?", "intent": "flow" },
    { "text": "How should staff handle cases where a submitted form needs to be corrected?", "intent": "flow" },
    { "text": "What steps must be followed if a client requests changes after submitting a form?", "intent": "flow" },
    { "text": "What is the recommended process for replacing or reassigning a form that cannot be reopened after submission?", "intent": "flow" },

    { "text": "Why might a client not see a form that was assigned to them?", "intent": "information" },
    { "text": "What conditions must be met for a client to see an assigned form in the portal?", "intent": "information" },
    { "text": "What are the common reasons an assigned form does not appear for the client?", "intent": "information" },
    { "text": "What factors affect whether a client can view forms assigned through the portal?", "intent": "information" },
    { "text": "Why isn’t the assigned form showing up for the client, even though it was sent?", "intent": "error" },
    { "text": "The client cannot see the form that was assigned—what could be causing this issue?", "intent": "error" },
    { "text": "The assigned form is missing from the client’s portal—what should I troubleshoot?", "intent": "error" },
    { "text": "The system says the form was assigned, but the client can’t find it—what might be wrong?", "intent": "error" },
    { "text": "What steps should I follow to resolve the issue when a client cannot see an assigned form?", "intent": "flow" },
    { "text": "What is the recommended workflow for fixing a missing form assignment in the client portal?", "intent": "flow" },
    { "text": "How should staff proceed when the client does not see the form that was assigned to them?", "intent": "flow" },
    { "text": "What is the correct process to verify and restore visibility of an assigned form in the portal?", "intent": "flow" },

    { "text": "Why is the system not allowing me to assign the form—what could be causing the issue?", "intent": "error" },
    { "text": "The Assign option is missing for the form—what might be wrong?", "intent": "error" },
    { "text": "I tried assigning the form but nothing happens—what could be preventing the assignment?", "intent": "error" },
    { "text": "The form won’t assign even though it’s selected—what should I troubleshoot?", "intent": "error" },
    { "text": "What steps should I follow to verify why I cannot assign the form?", "intent": "flow" },
    { "text": "What is the correct workflow to determine why the form assignment is not working?", "intent": "flow" },
    { "text": "Which parts of the assignment process should I review when the system doesn’t allow the form to be assigned?", "intent": "flow" },
    { "text": "What is the recommended flow to confirm all requirements before assigning a form?", "intent": "flow" },

    { "text": "Where can I check the status of a form to confirm whether the client has submitted it?", "intent": "information" },
    { "text": "How does the system indicate that a client has submitted their assigned form?", "intent": "information" },
    { "text": "What is the best way to verify if a client has completed and submitted a form?", "intent": "information" },
    { "text": "Does CareLogic provide a submission status or indicator for client‑submitted forms?", "intent": "information" },
    { "text": "The client says they submitted the form, but I can't confirm it—what could be wrong?", "intent": "error" },
    { "text": "Why isn’t the system showing the form as submitted even though the client claims they completed it?", "intent": "error" },
    { "text": "The portal doesn’t display any submission status—how do I verify if the client actually sent the form?", "intent": "error" },
    { "text": "The submitted form isn’t appearing where expected—how do I check if it was truly submitted?", "intent": "error" },
    { "text": "What steps should I follow to confirm that the client has submitted their form?", "intent": "flow" },
    { "text": "What is the workflow to check submission status in CareLogic after a client completes a form?", "intent": "flow" },
    { "text": "How does the verification flow work for tracking whether a client has submitted a form?", "intent": "flow" },
    { "text": "Which parts of the workflow show the submission confirmation for the client’s form?", "intent": "flow" },

    { "text": "What security and audit standards does Portal Form Assignment comply with?", "intent": "information" },
    { "text": "Does Portal Form Assignment follow industry‑approved security and audit requirements?", "intent": "information" },
    { "text": "What security measures and audit controls are implemented in Portal Form Assignment?", "intent": "information" },
    { "text": "Does the Portal Form Assignment feature meet organizational and regulatory security expectations?", "intent": "information" }
]